InformationRegisters/СобственныеКонтрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СобственныеКонтрагенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПраваПользователейНаДоступКБалансовымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПраваПользователейНаДоступКБалансовымСчетам</Name>
			<Comment>Список запрешенных счетов к использованию пользователем</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПоАвизо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоАвизо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АвизоПоПрочимОперациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>АвизоПоПрочимОперациям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСоСтруктурнымПодразделением</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоАвизо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АвизоПоПрочимОперациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корреспонденции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоБУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоТиповые</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ИсточникиФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИсточникиФинансирования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойСчетУчетаДС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СчетаУчетаДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfAccounts/Типовой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfAccounts>
		<Properties>
			<Name>Типовой</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоТиповые</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

CommonModules/ДополнительныеОбщегоНазначения/Ext/Module.bsl
/////////////////////////////////////////
//
Функция ПолучитьСчетаБанка(ИсточникФинансирования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникФинансирования", ИсточникФинансирования);
	
	Запрос.Текст=
	"ВЫБРАТЬ Различные
	|	ИФ.СчетУчета КАК СчетУчета
	|ИЗ
	|	Справочник.ИсточникиФинансирования.СчетаУчетаДС КАК ИФ
	|ГДЕ 
	|	ИФ.ссылка = &ИсточникФинансирования
	|Автоупорядочивание
	|";
	
	тз = Запрос.Выполнить().Выгрузить();
	
	Возврат тз;
КонецФункции

/////////////////////////////////////////
//

Функция ПолучитьСчетУчетаБанковскихДенежныхСредств(СчетБанк,ИсточникФинансирования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникФинансирования", ИсточникФинансирования);
	Запрос.УстановитьПараметр("СчетБанка", СчетБанк);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""1"" КАК Приоритет,
	|	ИФ.СчетУчета КАК счетУчета
	|ИЗ
	|	Справочник.ИсточникиФинансирования.СчетаУчетаДС КАК ИФ
	|ГДЕ 
	|	ИФ.ссылка = &ИсточникФинансирования
	|	И ИФ.СчетУчета = &СчетБанка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	""2"" КАК Приоритет,
	|	ИФ.ОсновнойСчетУчетаДС КАК счетУчета
	|ИЗ
	|	Справочник.ИсточникиФинансирования КАК ИФ
	|ГДЕ 
	|	ИФ.ссылка = &ИсточникФинансирования
	|Автоупорядочивание
	|";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Результат.Следующий();
	
	Возврат Результат.СчетУчета;
КонецФункции


Функция НачалоВыборкаСпискаИсточниковФинансирования(мСписокИсточниковФинансирования, ПредставлениеСпискаИсточниковФинансирования, ЭлементФормы, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораИсточниковФинансирования = ПолучитьОбщуюФорму("ФормаВыбораИсточниковФинансирования", ЭлементФормы);
	ФормаВыбораИсточниковФинансирования.мСписокИсточниковФинансирования = мСписокИсточниковФинансирования;
	РезультатВыбора = ФормаВыбораИсточниковФинансирования.ОткрытьМодально();
	Если РезультатВыбора <> Неопределено Тогда
		мСписокИсточниковФинансирования = РезультатВыбора;
		ПредставлениеСпискаИсточниковФинансирования = работаСДиалогами.ВыгрузитьСписокВСтроку(мСписокИсточниковФинансирования);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // НачалоВыборкаСпискаИсточниковФинансирования

Процедура ОтборПоПлануСчетов(Элемент,ИсточникФинансирования) Экспорт
	
	Если Не ЗначениеЗаполнено(ИсточникФинансирования) Тогда
		Предупреждение("Не задан источник финансирования !!!");
		Возврат;
	КонецЕсли;
		
	ФормаВыбора = Планысчетов.Типовой.ПолучитьФормуВыбора(, Элемент, );
	
	ФормаВыбора.ПланСчетовСписок.Отбор.ТипСчета.Значение = ИсточникФинансирования.ТипСчета;
	ФормаВыбора.ПланСчетовСписок.Отбор.ТипСчета.Использование = Истина;
	
	ФормаВыбора.Открыть();

КонецПроцедуры

Процедура ОбработатьСозданиеАвизо(ЭтотОбъект,СтруктураШапкиДокумента)Экспорт
	
	Админ = Справочники.Пользователи.НайтиПоНаименованию("Администратор");
	
	Если глТекущийПользователь = СтруктураШапкиДокумента.Автор 
		ИЛИ глТекущийПользователь = Админ Тогда
		ТекОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(?(глТекущийПользователь = Админ, Админ, СтруктураШапкиДокумента.Автор), "ОсновнаяОрганизация");
		Если ТекОрганизация = СтруктураШапкиДокумента.Организация Тогда
			Если Не ЗначениеЗаполнено(ЭтотОбъект.СвязанныйДокумент) Тогда
				
				Если Вопрос("Создать встречное Авизо?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
								
				НовыйДокумент = Документы.АвизоПоПрочимОперациям.СоздатьДокумент();
			Иначе
				
				Если Вопрос("Изменить встречное Авизо?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
				
				НовыйДокумент = ЭтотОбъект.СвязанныйДокумент.ПолучитьОбъект();
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Значение = СтруктураШапкиДокумента.Организация;
			НаборЗаписей.Отбор.Организация.Использование = Истина;
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				КонтрагентОрганизации = НаборЗаписей[0].Контрагент;
			Иначе
				КонтрагентОрганизации = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контрагент.Значение = СтруктураШапкиДокумента.Контрагент;
			НаборЗаписей.Отбор.Контрагент.Использование = Истина;
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				ОрганизацияКонтрагента = НаборЗаписей[0].Организация;
			Иначе
				ОрганизацияКонтрагента = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;
			
			НовыйДокумент.Дата = ЭтотОбъект.Дата;
			НовыйДокумент.Организация = ОрганизацияКонтрагента;
			НовыйДокумент.ГоловнойКонтрагент = СтруктураШапкиДокумента.ГоловнойКонтрагент;
			НовыйДокумент.ИсточникФинансирования = СтруктураШапкиДокумента.ИсточникФинансирования;
			НовыйДокумент.СчетУчетаРасчетовСоСтруктурнымПодразделением = СтруктураШапкиДокумента.СчетУчетаРасчетовСоСтруктурнымПодразделением;
			Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоАвизо.Дебет Тогда
				Новыйдокумент.ВидОперации = Перечисления.ВидыОперацийПоАвизо.Кредит;
			ИначеЕсли ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоАвизо.Кредит Тогда
				Новыйдокумент.ВидОперации = Перечисления.ВидыОперацийПоАвизо.Дебет;
			КонецЕсли;
			НовыйДокумент.Контрагент = КонтрагентОрганизации;
			НовыйДокумент.ДоговорКонтрагента = СтруктураШапкиДокумента.ДоговорКонтрагента;
			НовыйДокумент.Автор = СтруктураШапкиДокумента.Автор;
			НовыйДокумент.Комментарий = СтруктураШапкиДокумента.Комментарий;
			
			НовыйДокумент.Корреспонденции.Очистить();
			
			тз = ЭтотОбъект.Корреспонденции.Выгрузить();
			НовыйДокумент.Корреспонденции.Загрузить(тз);
			НовыйДокумент.Записать();
			ЭтотОбъект.СвязанныйДокумент= НовыйДокумент.Ссылка;
			ЭтотОбъект.Записать();
			
			//Объект = НовыйДокумент.ссылка.ПолучитьОбъект();
			//Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Предупреждение("Сформировано встречное авизо для "+ОрганизацияКонтрагента+" Сохраните документ !!!!");
			
			Объект = НовыйДокумент.ссылка.ПолучитьФорму();
			Объект.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаДоступностиСчета(глТекущийПользователь,Счет) Экспорт
	ВозвОтказ = ложь;
	
	Запрос = Новый запрос;
	
	Запрос.УстановитьПараметр("ТекПользователь",глТекущийПользователь);
	Запрос.УстановитьПараметр("Счет",Счет);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПраваПользователейНаДоступКБалансовымСчетам.Счет
	|ИЗ
	|	РегистрСведений.ПраваПользователейНаДоступКБалансовымСчетам КАК ПраваПользователейНаДоступКБалансовымСчетам
	|ГДЕ
	|	ПраваПользователейНаДоступКБалансовымСчетам.Пользователь = &ТекПользователь
	|	И ПраваПользователейНаДоступКБалансовымСчетам.Счет = &Счет";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ВозвОтказ = Истина;
	КонецЕсли;
	
	Возврат ВозвОтказ;
КонецФункции
